In [1]:
import pandas as pd

## Import Raw Files

In [125]:
student_list = pd.read_csv('data/student_list.csv', skiprows=[1])

In [126]:
historical = pd.read_csv('data/Historical Demographic Data.csv', header=1)

In [127]:
student_program = pd.read_csv('data/Student Query Name and Program.csv')

In [128]:
student_list.head()

                   name  name_title ethnicity
0       Omar M. Barakat         NaN     Asian
1           Lucas Breit         NaN     Asian
2          Stella Breit         NaN     Asian
3  Julian Rizk Callahan         NaN     Asian
4       Magnolia Ciardi         NaN     Asian

In [129]:
student_list.shape

(338, 3)

In [130]:
historical

,Year,Enrollment,Asian,AA,Latino,White,total non-white,%,Unnamed: 8,Same Gender Parents
0,2008-2009,295,30.0,6.0,23.0,236.0,59.0,20.00%,NaN,4.0
1,2009-2010,316,30.0,7.0,22.0,257.0,59.0,18.67%,NaN,6.0
2,2010-2011,334,39.0,4.0,25.0,266.0,68.0,20.36%,NaN,6.0
3,2011-2012,350,41.0,7.0,22.0,280.0,70.0,20.00%,NaN,8.0
4,2012-2013,371,55.0,10.0,27.0,279.0,92.0,24.80%,NaN,11.0
5,2013-2014,376,49.0,12.0,30.0,285.0,91.0,24.20%,NaN,11.0
6,2014-2015,383,47.0,13.0,32.0,291.0,92.0,24.02%,NaN,13.0
7,2015-2016,397,55.0,16.0,32.0,294.0,103.0,25.94%,NaN,16.0
8,2016-2017,405,59.0,17.0,36.0,293.0,112.0,27.65%,NaN,17.0
9,2017-2018,410,58.0,20.0,40.0,292.0,118.0,28.78%,NaN,25.0
10,2018-2019,411,55.0,20.0,41.0,295.0,116.0,28.22%,NaN,21.0
11,2019-2020,391,59.0,16.0,44.0,272.0,119.0,30.40%,NaN,17.0
12,2020-2021,333,45.0,10.0,37.0,241.0,92.0,27.60%,NaN,9.0
13,2021-2022,365,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [131]:
student_program.head()

,Person ID,Full Name,Current Grade,Ethnicity,Enrollment Status,Roles
0,100314.0,"Bechard, Declan",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud"
1,100318.0,"Carrigan, JonMateo",Toddler,Multi-racial,EN: Newly Enrolled,"Student (T), Prg Stud"
2,100319.0,"Ciardi, Nelson",Toddler,Asian,EN: Newly Enrolled,"Student (T), Prg Stud"
3,100320.0,"Elkington, Max",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud"
4,100354.0,"Gaster, Eve",Toddler,<None Specified>,EN: Newly Enrolled,Student (T)

In [132]:
student_program.shape

(365, 6)

In [133]:
names = student_program['Full Name'].str.split(',', expand=True)

In [134]:
names.head(2)

          0          1
0   Bechard     Declan
1  Carrigan   JonMateo

In [135]:
student_program['Last Name'] = names[0]

In [136]:
student_program['First Name'] = names[1]

In [137]:
student_list['name'].str.split(' ', expand=True)

            0         1         2     3
0        Omar        M.   Barakat  None
1       Lucas     Breit      None  None
2      Stella     Breit      None  None
3      Julian      Rizk  Callahan  None
4    Magnolia    Ciardi      None  None
..        ...       ...       ...   ...
333   Rebecca     Asher    Wilson  None
334       Ava      Wise      None  None
335       Asa  Trussell   Wolfson  None
336      Alec   Younger      None  None
337   Annabel    Zolner      None  None

[338 rows x 4 columns]

In [138]:
student_list.head(3)

              name  name_title ethnicity
0  Omar M. Barakat         NaN     Asian
1      Lucas Breit         NaN     Asian
2     Stella Breit         NaN     Asian

In [139]:
student_list['name']

0           Omar M. Barakat
1               Lucas Breit
2              Stella Breit
3      Julian Rizk Callahan
4           Magnolia Ciardi
               ...
333    Rebecca Asher Wilson
334                Ava Wise
335    Asa Trussell Wolfson
336            Alec Younger
337          Annabel Zolner
Name: name, Length: 338, dtype: object

In [140]:
p = r'^(?P<First_Name>.*) \b\s*(?P<Middle_Name>.*) (?P<Last_Name>\S+)' 
middle = student_list['name'].str.extract(p)

In [141]:
middle = middle.dropna()

In [142]:
p = r'^(?P<First_Name>.*) (?P<Last_Name>\S+)' 
last = student_list['name'].str.extract(p)

In [143]:
student_list_combined = pd.merge(student_list, last, how='left',left_index=True, right_index=True)

In [144]:
student_list_combined = pd.merge(student_list_combined, middle, how='left',left_index=True, right_index=True)

In [145]:
student_list_combined.head()

,name,name_title,ethnicity,First_Name_x,Last_Name_x,First_Name_y,Middle_Name,Last_Name_y
0,Omar M. Barakat,NaN,Asian,Omar M.,Barakat,Omar,M.,Barakat
1,Lucas Breit,NaN,Asian,Lucas,Breit,NaN,NaN,NaN
2,Stella Breit,NaN,Asian,Stella,Breit,NaN,NaN,NaN
3,Julian Rizk Callahan,NaN,Asian,Julian Rizk,Callahan,Julian,Rizk,Callahan
4,Magnolia Ciardi,NaN,Asian,Magnolia,Ciardi,NaN,NaN,NaN

In [146]:
student_list_combined.loc[student_list_combined['First_Name_y'].isnull(), 'First_Name_y'] = student_list_combined['First_Name_x']

In [147]:
student_list_combined.loc[student_list_combined['Last_Name_y'].isnull(), 'Last_Name_y'] = student_list_combined['Last_Name_x']

In [148]:
student_list_combined.head()

,name,name_title,ethnicity,First_Name_x,Last_Name_x,First_Name_y,Middle_Name,Last_Name_y
0,Omar M. Barakat,NaN,Asian,Omar M.,Barakat,Omar,M.,Barakat
1,Lucas Breit,NaN,Asian,Lucas,Breit,Lucas,NaN,Breit
2,Stella Breit,NaN,Asian,Stella,Breit,Stella,NaN,Breit
3,Julian Rizk Callahan,NaN,Asian,Julian Rizk,Callahan,Julian,Rizk,Callahan
4,Magnolia Ciardi,NaN,Asian,Magnolia,Ciardi,Magnolia,NaN,Ciardi

In [149]:
student_list_combined = student_list_combined.drop(columns=['First_Name_x','Last_Name_x'], index=1)

In [150]:
student_list_combined.columns

Index(['name', 'name_title', 'ethnicity', 'First_Name_y', 'Middle_Name',
       'Last_Name_y'],
      dtype='object')

In [151]:
student_list_combined.columns = ['name', 'name_title', 'ethnicity', 'First Name', 'Middle Name',
       'Last Name']

In [152]:
student_list_combined.columns

Index(['name', 'name_title', 'ethnicity', 'First Name', 'Middle Name',
       'Last Name'],
      dtype='object')

In [153]:
student_list_combined['First Name'] = student_list_combined['First Name'].str.strip()
student_list_combined['Last Name'] = student_list_combined['Last Name'].str.strip()
student_program['First Name'] = student_program['First Name'].str.strip()
student_program['Last Name'] = student_program['Last Name'].str.strip()

In [154]:
student_list_combined.head()

                   name  name_title ethnicity First Name Middle Name Last Name
0       Omar M. Barakat         NaN     Asian       Omar          M.   Barakat
2          Stella Breit         NaN     Asian     Stella         NaN     Breit
3  Julian Rizk Callahan         NaN     Asian     Julian        Rizk  Callahan
4       Magnolia Ciardi         NaN     Asian   Magnolia         NaN    Ciardi
5       Nelson D Ciardi         NaN     Asian     Nelson           D    Ciardi

In [155]:
student_program.head()

,Person ID,Full Name,Current Grade,Ethnicity,Enrollment Status,Roles,Last Name,First Name
0,100314.0,"Bechard, Declan",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud",Bechard,Declan
1,100318.0,"Carrigan, JonMateo",Toddler,Multi-racial,EN: Newly Enrolled,"Student (T), Prg Stud",Carrigan,JonMateo
2,100319.0,"Ciardi, Nelson",Toddler,Asian,EN: Newly Enrolled,"Student (T), Prg Stud",Ciardi,Nelson
3,100320.0,"Elkington, Max",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud",Elkington,Max
4,100354.0,"Gaster, Eve",Toddler,<None Specified>,EN: Newly Enrolled,Student (T),Gaster,Eve

In [159]:
combined_student_list = pd.merge(student_program, student_list_combined, how='left',
                                 on =['First Name','Last Name'])

In [160]:
combined_student_list.shape

(365, 12)

In [174]:
combined_student_list.head()

,Person ID,Full Name,Current Grade,Ethnicity,Enrollment Status,Roles,Last Name,First Name,name,name_title,ethnicity,Middle Name
0,100314.0,"Bechard, Declan",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud",Bechard,Declan,Declan Bechard,NaN,White,NaN
1,100318.0,"Carrigan, JonMateo",Toddler,Multi-racial,EN: Newly Enrolled,"Student (T), Prg Stud",Carrigan,JonMateo,NaN,NaN,NaN,NaN
2,100319.0,"Ciardi, Nelson",Toddler,Asian,EN: Newly Enrolled,"Student (T), Prg Stud",Ciardi,Nelson,Nelson D Ciardi,NaN,Asian,D
3,100320.0,"Elkington, Max",Toddler,Caucasian,EN: Newly Enrolled,"Student (T), Prg Stud",Elkington,Max,Max Elkington,NaN,White,NaN
4,100354.0,"Gaster, Eve",Toddler,<None Specified>,EN: Newly Enrolled,Student (T),Gaster,Eve,Eve Gaster,NaN,Prefer Not To Answer,NaN

In [168]:
combined_student_list = combined_student_list.dropna(how='all')

In [172]:
# combined_student_list[combined_student_list['ethnicity'].isnull()]

In [173]:
combined_student_list.columns

Index(['Person ID', 'Full Name', 'Current Grade', 'Ethnicity',
       'Enrollment Status', 'Roles', 'Last Name', 'First Name', 'name',
       'name_title', 'ethnicity', 'Middle Name'],
      dtype='object')

In [175]:
final_student_list = combined_student_list[['First Name', 'Last Name', 'ethnicity', 'Current Grade']]

In [183]:
final_student_list.shape

(361, 4)

In [177]:
final_student_list.to_csv('data/final_student_list.csv', index=False)

In [180]:
final_student_list[~final_student_list['ethnicity'].isnull()].shape

(323, 4)

In [ ]:
final_student_list['ethnicity'].value_counts()

## Map

In [8]:
import geopandas as gpd
import matplotlib.pyplot as plt
import pyproj
import plotly.graph_objs as go

In [9]:
chi_zips = gpd.read_file(r"Boundaries - ZIP Codes/geo_export_a9707f61-f834-4e7b-b8a5-0f0ff4c8412d.shp")

In [10]:
map_df = chi_zips 
map_df.to_crs(pyproj.CRS.from_epsg(4326), inplace=True)

In [12]:
map_df.head()

,objectid,shape_area,shape_len,zip,geometry
0,33.0,1.060523e+08,42720.044406,60647,"POLYGON ((-87.67762 41.91776, -87.67761 41.917..."
1,34.0,1.274761e+08,48103.782721,60639,"POLYGON ((-87.72683 41.92265, -87.72693 41.922..."
2,35.0,4.506904e+07,27288.609612,60707,"POLYGON ((-87.78500 41.90915, -87.78531 41.909..."
3,36.0,7.085383e+07,42527.989679,60622,"POLYGON ((-87.66707 41.88885, -87.66707 41.888..."
4,37.0,9.903962e+07,47970.140153,60651,"POLYGON ((-87.70656 41.89555, -87.70672 41.895..."

In [15]:
import folium
import branca.colormap as cm

In [16]:
x_map=map_df.centroid.x.mean()-1
y_map=map_df.centroid.y.mean()-1

<ipython-input-16-e3ebea0728f0>:1: UserWarning: Geometry is in a geographic CRS. Results from 'centroid' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  x_map=map_df.centroid.x.mean()
<ipython-input-16-e3ebea0728f0>:2: UserWarning: Geometry is in a geographic CRS. Results from 'centroid' are likely incorrect. Use 'GeoSeries.to_crs()' to re-project geometries to a projected CRS before this operation.

  y_map=map_df.centroid.y.mean()

In [25]:
mymap = folium.Map(location=[y_map, x_map], zoom_start=12,tiles=None)
folium.TileLayer('CartoDB positron',name="Light Map",control=False).add_to(mymap)
mymap